GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2021-08-20     BruceOu      first implementation
 */

#include "drv_usart.h"

#ifdef RT_USING_SERIAL

#ifndef USART_TRANSMIT_DMA_ENABLE
#define USART_TRANSMIT_DMA_ENABLE USART_DENT_ENABLE
#endif
#ifndef USART_TRANSMIT_DMA_DISABLE
#define USART_TRANSMIT_DMA_DISABLE USART_DENT_DISABLE
#endif
#ifndef USART_RECEIVE_DMA_ENABLE
#define USART_RECEIVE_DMA_ENABLE USART_DENR_ENABLE
#endif
#ifndef USART_RECEIVE_DMA_DISABLE
#define USART_RECEIVE_DMA_DISABLE USART_DENR_DISABLE
#endif

#ifdef SOC_SERIES_GD32M53x
/* Map legacy USART names to UART for GD32M53x */
#define USART0                     UART0
#define USART1                     UART1
#define USART2                     UART2
#define USART3                     UART3
#define USART0_IRQn                UART0_IRQn
#define USART1_IRQn                UART1_IRQn
#define USART2_IRQn                UART2_IRQn
#define USART3_IRQn                UART3_IRQn
#define RCU_USART0                 RCU_UART0
#define RCU_USART1                 RCU_UART1
#define RCU_USART2                 RCU_UART2
#define RCU_USART3                 RCU_UART3

/* Map USART APIs to UART APIs */
#define usart_baudrate_set         uart_baudrate_set
#define usart_word_length_set      uart_word_length_set
#define usart_stop_bit_set         uart_stop_bit_set
#define usart_parity_config        uart_parity_config
#define usart_receive_config       uart_receive_config
#define usart_transmit_config      uart_transmit_config
#define usart_enable               uart_enable
#define usart_disable              uart_disable
#define usart_interrupt_enable     uart_interrupt_enable
#define usart_interrupt_disable    uart_interrupt_disable
#define usart_flag_get             uart_flag_get
#define usart_flag_clear           uart_flag_clear
#define usart_data_transmit        uart_data_transmit
#define usart_data_receive         uart_data_receive
#define usart_interrupt_flag_get   uart_interrupt_flag_get

/* Map USART enums to UART enums */
#define USART_WL_9BIT              UART_WL_9BIT
#define USART_WL_8BIT              UART_WL_8BIT
#define USART_STB_2BIT             UART_STB_2BIT
#define USART_STB_1BIT             UART_STB_1BIT
#define USART_PM_ODD               UART_PM_ODD
#define USART_PM_EVEN              UART_PM_EVEN
#define USART_PM_NONE              UART_PM_NONE
#define USART_RECEIVE_ENABLE       UART_RECEIVE_ENABLE
#define USART_TRANSMIT_ENABLE      UART_TRANSMIT_ENABLE
#define USART_INT_RBNE             UART_INT_RBNE
#define USART_INT_TC               UART_INT_TC
#define USART_FLAG_RBNE            UART_FLAG_RBNE
#define USART_FLAG_TBE             UART_FLAG_TBE
#define USART_FLAG_TC              UART_FLAG_TC
#define USART_FLAG_ORERR           UART_FLAG_ORERR
#define USART_INT_FLAG_RBNE        UART_INT_FLAG_RBNE
#define USART_INT_FLAG_TC          UART_INT_FLAG_TC
#endif /* SOC_SERIES_GD32M53x */

#if !defined(BSP_USING_UART0) && !defined(BSP_USING_UART1) && \
    !defined(BSP_USING_UART2) && !defined(BSP_USING_UART3) && \
    !defined(BSP_USING_UART4) && !defined(BSP_USING_UART5) && \
    !defined(BSP_USING_UART6) && !defined(BSP_USING_UART7)
#error "Please define at least one UARTx"

#endif

#include <rtdevice.h>

#ifdef RT_SERIAL_USING_DMA
static void gd32_dma_config(struct rt_serial_device *serial, rt_ubase_t flag);
static void gd32_dma_tx_config(struct rt_serial_device *serial, rt_ubase_t flag);
static void dma_rx_done_isr(struct rt_serial_device *serial);

/* DMA TX threshold: transfers smaller than this use polling instead of DMA */
#ifdef BSP_UART_DMA_TX_THRESHOLD
#define GD32_DMA_TX_THRESHOLD   BSP_UART_DMA_TX_THRESHOLD
#else
#define GD32_DMA_TX_THRESHOLD   8
#endif
#endif /* RT_SERIAL_USING_DMA - forward declarations */

static void GD32_UART_IRQHandler(struct rt_serial_device *serial);

/*******************************************************************************
 * Serial device and DMA config declarations
 * (Moved before uart_obj to satisfy initialization dependencies)
 ******************************************************************************/
#if defined(BSP_USING_UART0)
struct rt_serial_device serial0;
#if defined(BSP_UART0_RX_USING_DMA)
static struct dma_config uart0_dma_rx_config = UART0_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART0_TX_USING_DMA)
static struct dma_config uart0_dma_tx_config = UART0_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART0 */

#if defined(BSP_USING_UART1)
struct rt_serial_device serial1;
#if defined(BSP_UART1_RX_USING_DMA) || defined(RT_SERIAL_USING_DMA)
struct dma_config uart1_rxdma = UART1_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART1_TX_USING_DMA) || defined(RT_SERIAL_USING_TX_DMA)
struct dma_config uart1_txdma = UART1_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART1 */

#if defined(BSP_USING_UART2)
struct rt_serial_device serial2;
#if defined(RT_SERIAL_USING_DMA)
#if defined(BSP_UART2_RX_USING_DMA)
struct dma_config uart2_rxdma = UART2_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART2_TX_USING_DMA)
struct dma_config uart2_txdma = UART2_DMA_TX_CONFIG;
#endif
#endif
#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)
struct rt_serial_device serial3;
#if defined(BSP_UART3_RX_USING_DMA) || defined(RT_SERIAL_USING_DMA)
struct dma_config uart3_rxdma = UART3_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART3_TX_USING_DMA) || defined(RT_SERIAL_USING_TX_DMA)
struct dma_config uart3_txdma = UART3_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART3 */

#if defined(BSP_USING_UART4)
struct rt_serial_device serial4;
#if defined(BSP_UART4_RX_USING_DMA) || defined(RT_SERIAL_USING_DMA)
struct dma_config uart4_rxdma = UART4_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART4_TX_USING_DMA) || defined(RT_SERIAL_USING_TX_DMA)
struct dma_config uart4_txdma = UART4_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART4 */

#if defined(BSP_USING_UART5)
struct rt_serial_device serial5;
#if defined(BSP_UART5_RX_USING_DMA) || defined(RT_SERIAL_USING_DMA)
struct dma_config uart5_rxdma = UART5_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART5_TX_USING_DMA) || defined(RT_SERIAL_USING_TX_DMA)
struct dma_config uart5_txdma = UART5_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART5 */

#if defined(BSP_USING_UART6)
struct rt_serial_device serial6;
#if defined(BSP_UART6_RX_USING_DMA) || defined(RT_SERIAL_USING_DMA)
struct dma_config uart6_rxdma = UART6_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART6_TX_USING_DMA) || defined(RT_SERIAL_USING_TX_DMA)
struct dma_config uart6_txdma = UART6_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART6 */

#if defined(BSP_USING_UART7)
struct rt_serial_device serial7;
#if defined(BSP_UART7_RX_USING_DMA) || defined(RT_SERIAL_USING_DMA)
struct dma_config uart7_rxdma = UART7_DMA_RX_CONFIG;
#endif
#if defined(BSP_UART7_TX_USING_DMA) || defined(RT_SERIAL_USING_TX_DMA)
struct dma_config uart7_txdma = UART7_DMA_TX_CONFIG;
#endif
#endif /* BSP_USING_UART7 */

