GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    dma_rx_done_isr(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}

void UART2_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(UART2_TX_DMA_PERIPH, UART2_TX_DMA_CHANNEL);

    /* leave interrupt */
    rt_interrupt_leave();
}
#elif defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || !defined(SOC_SERIES_GD32F5xx)
void DMA0_Channel4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}


#if defined(BSP_UART2_TX_USING_DMA)
void DMA0_Channel5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(DMA0, DMA_CH5);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif
#endif /* RT_SERIAL_USING_DMA */

void USART2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial2);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)

#if defined(RT_SERIAL_USING_DMA)

#if defined(SOC_SERIES_GD32F5xx)
void UART3_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial3);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART3_TX_USING_DMA
void UART3_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(UART3_TX_DMA_PERIPH, UART3_TX_DMA_CHANNEL);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#elif defined(SOC_SERIES_GD32H7xx) || !defined(SOC_SERIES_GD32F5xx)
void DMA0_Channel3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial3);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART3_TX_USING_DMA
void DMA1_Channel3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(DMA1, DMA_CH3);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif
#endif /* RT_SERIAL_USING_DMA */

void UART3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial3);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART3 */

#if defined(BSP_USING_UART4)

#if defined(RT_SERIAL_USING_DMA)

#if defined(SOC_SERIES_GD32F5xx)
void UART4_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial4);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART4_TX_USING_DMA
void UART4_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(UART4_TX_DMA_PERIPH, UART4_TX_DMA_CHANNEL);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#elif defined(SOC_SERIES_GD32H7xx) || !defined(SOC_SERIES_GD32F5xx)
void DMA0_Channel4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial4);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART4_TX_USING_DMA
void DMA1_Channel4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(DMA1, DMA_CH4);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif
#endif /* RT_SERIAL_USING_DMA */

void UART4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial4);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_USING_UART4 */

#if defined(BSP_USING_UART5)

#if defined(RT_SERIAL_USING_DMA)

#if defined(SOC_SERIES_GD32F5xx)
void UART5_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial5);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART5_TX_USING_DMA
void UART5_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(UART5_TX_DMA_PERIPH, UART5_TX_DMA_CHANNEL);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#elif defined(SOC_SERIES_GD32H7xx) || !defined(SOC_SERIES_GD32F5xx)
void DMA0_Channel5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial5);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART5_TX_USING_DMA
void DMA1_Channel5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(DMA1, DMA_CH5);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif
#endif /* RT_SERIAL_USING_DMA */

void USART5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial5);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART5 */

#if defined(BSP_USING_UART6)

#if defined(RT_SERIAL_USING_DMA)

#if defined(SOC_SERIES_GD32F5xx)
void UART6_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial6);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART6_TX_USING_DMA
void UART6_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(UART6_TX_DMA_PERIPH, UART6_TX_DMA_CHANNEL);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#elif defined(SOC_SERIES_GD32H7xx) || !defined(SOC_SERIES_GD32F5xx)
void DMA0_Channel6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial6);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART6_TX_USING_DMA
void DMA1_Channel6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(DMA1, DMA_CH6);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif
#endif /* RT_SERIAL_USING_DMA */

void UART6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial6);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART6 */

#if defined(BSP_USING_UART7)

#if defined(RT_SERIAL_USING_DMA)

#if defined(SOC_SERIES_GD32F5xx)
void UART7_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART7_TX_USING_DMA
void UART7_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(UART7_TX_DMA_PERIPH, UART7_TX_DMA_CHANNEL);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#elif defined(SOC_SERIES_GD32H7xx) || !defined(SOC_SERIES_GD32F5xx)
void DMA0_Channel7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_rx_done_isr(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_UART7_TX_USING_DMA
void DMA1_Channel7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    dma_tx_done_isr(DMA1, DMA_CH7);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#endif
#endif /* RT_SERIAL_USING_DMA */

void UART7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    GD32_UART_IRQHandler(&serial7);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART7 */

