GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
            dma_channel_disable(uart->dma_tx->periph, uart->dma_tx->channel);
            usart_dma_transmit_config(uart->uart_periph, USART_TRANSMIT_DMA_DISABLE);
            dma_deinit(uart->dma_tx->periph, uart->dma_tx->channel);
        }
#endif
#endif
        break;
    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        NVIC_EnableIRQ(uart->irqn);
#if defined SOC_SERIES_GD32E51x
        if (uart->uart_periph == USART5)
        {
            usart5_flag_clear(USART5, USART5_FLAG_RBNE);
            /* enable interrupt */
            usart5_interrupt_enable(USART5, USART5_INT_RBNE);
        }
        else
#endif
        {
            usart_flag_clear(uart->uart_periph, USART_FLAG_RBNE);
            /* enable interrupt */
            usart_interrupt_enable(uart->uart_periph, USART_INT_RBNE);
        }
        break;

#ifdef RT_SERIAL_USING_DMA
    case RT_DEVICE_CTRL_CONFIG:
        if (ctrl_arg == RT_DEVICE_FLAG_DMA_RX) {
            gd32_dma_config(serial, ctrl_arg);
        }
#ifdef RT_SERIAL_USING_TX_DMA
        else if (ctrl_arg == RT_DEVICE_FLAG_DMA_TX) {
            gd32_dma_tx_config(serial, ctrl_arg);
        }
#endif
        break;
#endif

    case RT_DEVICE_CTRL_CLOSE:
        usart_disable(uart->uart_periph);
        break;
    }

    return RT_EOK;
}

/**
  * @brief  uart put char
  * @param  serial, ch
  * @retval None
  */
static int gd32_uart_putc(struct rt_serial_device *serial, char ch)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;
    usart_data_transmit(uart->uart_periph, ch);
#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        while((usart5_flag_get(USART5, USART5_FLAG_TC) == RESET));
    }
    else
#endif
    {
        while((usart_flag_get(uart->uart_periph, USART_FLAG_TBE) == RESET));
    }

    return RT_EOK;
}

/**
  * @brief  uart get char
  * @param  serial
  * @retval None
  */
static int gd32_uart_getc(struct rt_serial_device *serial)
{
    int ch;
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;

    ch = -1;
#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        if (usart5_flag_get(USART5, USART5_FLAG_RBNE) != RESET)
            ch = usart_data_receive(USART5);
    }
    else
#endif
    {
        if (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET)
            ch = usart_data_receive(uart->uart_periph);
    }
    return ch;
}

#ifdef RT_SERIAL_USING_DMA
static void dma_uart_config(struct rt_serial_device *serial, uint32_t setting_recv_len,
                            void *mem_base_addr)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    dma_single_data_parameter_struct dma_init_struct;

    /* rx dma config */
    uart->setting_recv_len = setting_recv_len;
    /* Initialize last_recv_index: starts at bufsz, decreases as data received */
    uart->last_recv_index = setting_recv_len;
    dma_deinit(uart->dma_rx->periph, uart->dma_rx->channel);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.direction    = DMA_PERIPH_TO_MEMORY;
    dma_init_struct.memory0_addr = (uint32_t)mem_base_addr;
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_init_struct.number       = uart->setting_recv_len;
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.priority     = DMA_PRIORITY_HIGH;
#ifdef SOC_SERIES_GD32H7xx
    dma_init_struct.request      = uart->dma_rx->request;
    dma_init_struct.periph_addr  = (uint32_t)&(USART_RDATA(uart->uart_periph));
#elif defined(SOC_SERIES_GD32F5xx)
    dma_init_struct.periph_addr  = (uint32_t)&USART_DATA(uart->uart_periph);
#endif
    dma_single_data_mode_init(uart->dma_rx->periph, uart->dma_rx->channel, &dma_init_struct);
#if defined(SOC_SERIES_GD32F5xx)
    dma_channel_subperipheral_select(uart->dma_rx->periph, uart->dma_rx->channel, uart->dma_rx->subperiph);
#endif
    /* configure DMA mode - USE CIRCULAR MODE for zero data loss */
    dma_circulation_enable(uart->dma_rx->periph, uart->dma_rx->channel);

    dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_FTF);
    dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_HTF);
    /* Enable BOTH Half-Transfer and Full-Transfer interrupts */
    dma_interrupt_enable(uart->dma_rx->periph, uart->dma_rx->channel, DMA_CHXCTL_HTFIE);
    dma_interrupt_enable(uart->dma_rx->periph, uart->dma_rx->channel, DMA_CHXCTL_FTFIE);
}

static void gd32_dma_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    dma_single_data_parameter_struct dma_init_struct;

    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;

    /* wait IDLEF set and clear it */
    while(RESET == usart_flag_get(uart->uart_periph, USART_FLAG_IDLE)) {
        rt_thread_mdelay(10);
    }

    usart_flag_clear(uart->uart_periph, USART_FLAG_IDLE);
    /* enable transmit idle interrupt */
    usart_interrupt_enable(uart->uart_periph, USART_INT_IDLE);
    /* DMA clock enable */
    if(DMA0 == uart->dma_rx->periph) {
        rcu_periph_clock_enable(RCU_DMA0);
    } else if(DMA1 == uart->dma_rx->periph) {
        rcu_periph_clock_enable(RCU_DMA1);
    } else {
        Error_Handler();
    }

#ifdef SOC_SERIES_GD32H7xx
    /* enable DMAMUX clock */
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif

#ifdef RT_USING_CACHE
    /* clean d-cache */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, rx_fifo->buffer, serial->config.bufsz);
#endif

    /* rx dma config */
    dma_uart_config(serial, serial->config.bufsz, rx_fifo->buffer);

    usart_dma_receive_config(uart->uart_periph, USART_RECEIVE_DMA_ENABLE);
    dma_channel_enable(uart->dma_rx->periph, uart->dma_rx->channel);
    /* rx dma interrupt config */
    nvic_irq_enable(uart->dma_rx->irq, 1, 0);
}

#ifdef RT_SERIAL_USING_TX_DMA
static void gd32_dma_tx_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    dma_single_data_parameter_struct dma_init_struct;

