GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    /* DMA clock enable */
    if(DMA0 == uart->dma_tx->periph) {
        rcu_periph_clock_enable(RCU_DMA0);
    } else if(DMA1 == uart->dma_tx->periph) {
        rcu_periph_clock_enable(RCU_DMA1);
    } else {
        Error_Handler();
    }

#ifdef SOC_SERIES_GD32H7xx
    /* enable DMAMUX clock */
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif

#ifdef RT_USING_CACHE
    /* clean d-cache */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, rx_fifo->buffer, serial->config.bufsz);
#endif

    /* tx dma config */
    dma_deinit(uart->dma_tx->periph, uart->dma_tx->channel);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.direction    = DMA_MEMORY_TO_PERIPH;
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.priority     = DMA_PRIORITY_HIGH;
#ifdef SOC_SERIES_GD32H7xx
    dma_init_struct.request      = uart->dma_tx->request;
    dma_init_struct.periph_addr  = (uint32_t)&(USART_TDATA(uart->uart_periph));
#elif defined(SOC_SERIES_GD32F5xx)
    dma_init_struct.periph_addr  = (uint32_t)&USART_DATA(uart->uart_periph);
    dma_init_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
    dma_init_struct.number       = 0;   /* will be set in transmit function */
    dma_init_struct.memory0_addr = 0;   /* will be set in transmit function */
#endif
    dma_single_data_mode_init(uart->dma_tx->periph, uart->dma_tx->channel, &dma_init_struct);
#if defined(SOC_SERIES_GD32F5xx)
    dma_channel_subperipheral_select(uart->dma_tx->periph, uart->dma_tx->channel, uart->dma_tx->subperiph);
#endif
    /* configure DMA mode */
    dma_circulation_disable(uart->dma_tx->periph, uart->dma_tx->channel);
}

#ifdef RT_USING_CACHE
#ifdef BSP_SCB_ENABLE_D_CACHE
static uint8_t dma_buf_cache_pre_bk[32] = {0};
static uint8_t dma_buf_cache_post_bk[32] = {0};
#endif
#endif
static rt_ssize_t gd32_dma_transmit(struct rt_serial_device *serial, rt_uint8_t *buf, rt_size_t size, int direction)
{
    struct gd32_uart *uart;
    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(buf != RT_NULL);

    uart = (struct gd32_uart *) serial->parent.user_data;

    if (size == 0)
    {
        return 0;
    }

    if (RT_SERIAL_DMA_TX == direction)
    {
        /* Small transfers: use polling to avoid DMA setup overhead */
        if (size < GD32_DMA_TX_THRESHOLD)
        {
            rt_size_t i;
            for (i = 0; i < size; i++)
            {
                gd32_uart_putc(serial, buf[i]);
            }
            /* wait for last byte fully shifted out */
            while (usart_flag_get(uart->uart_periph, USART_FLAG_TC) == RESET);
            /* notify framework that transmission is complete */
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
            return size;
        }

#ifdef RT_USING_CACHE
#ifdef BSP_SCB_ENABLE_D_CACHE
        uint32_t *dma_cache_pre_ptr = NULL, *dma_cache_post_ptr = NULL;
        uint32_t pre_size = (rt_uint32_t)buf & (rt_uint32_t)0x1F;
        dma_cache_pre_ptr = (uint32_t *)((uint32_t)buf - pre_size);
        rt_memcpy(dma_buf_cache_pre_bk, dma_cache_pre_ptr, pre_size);
        dma_cache_post_ptr = (uint32_t *)((uint32_t)buf + size);
        rt_memcpy(dma_buf_cache_post_bk, dma_cache_post_ptr, sizeof(dma_buf_cache_post_bk));
        /* invalidate d-cache */
        rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, buf, size);

        rt_memcpy(dma_cache_pre_ptr, dma_buf_cache_pre_bk, pre_size);
        rt_memcpy(dma_cache_post_ptr, dma_buf_cache_post_bk, sizeof(dma_buf_cache_post_bk));
#endif
#endif

        dma_memory_address_config(uart->dma_tx->periph, uart->dma_tx->channel, DMA_MEMORY_0, (uint32_t)buf);
        dma_transfer_number_config(uart->dma_tx->periph, uart->dma_tx->channel, size);

        dma_flag_clear(uart->dma_tx->periph, uart->dma_tx->channel, uart->dma_tx->dma_flag);
        dma_interrupt_enable(uart->dma_tx->periph, uart->dma_tx->channel, DMA_CHXCTL_FTFIE);

        usart_flag_clear(uart->uart_periph, USART_FLAG_TBE);
        usart_flag_clear(uart->uart_periph, USART_FLAG_TC);
        /* enable transmit idle interrupt */
        usart_interrupt_enable(uart->uart_periph, USART_INT_TC);

        usart_dma_transmit_config(uart->uart_periph, USART_TRANSMIT_DMA_ENABLE);
        /* tx dma interrupt config */
        nvic_irq_enable(uart->dma_tx->irq, 1, 0);

        dma_channel_enable(uart->dma_tx->periph, uart->dma_tx->channel);

        return size;
    }
    return 0;
}
#endif

#ifdef RT_USING_CACHE
static struct rt_serial_rx_fifo rx_fifo_cahce_bk = {0};
static uint8_t rx_fifo_buf_cache_bk[32] = {0};
#endif

/**
 * Serial port receive idle process. This need add to uart idle ISR.
 *
 * @param serial serial device
 */
static void dma_uart_rx_idle_isr(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    rt_base_t level;
    rt_size_t recv_len, counter;

    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;

    /* Clear IDLE flag - read STAT then DATA to clear */
    usart_flag_clear(uart->uart_periph, USART_FLAG_IDLE);
    usart_data_receive(uart->uart_periph);

    level = rt_hw_interrupt_disable();

    recv_len = 0;
    counter = dma_transfer_number_get(uart->dma_rx->periph, uart->dma_rx->channel);

#ifdef RT_USING_CACHE
    uint32_t *rx_fifo_end_ptr = NULL;
    rx_fifo_end_ptr = (uint32_t *)((uint32_t)rx_fifo->buffer + serial->config.bufsz);
    rt_memcpy(&rx_fifo_cahce_bk, rx_fifo, sizeof(rx_fifo_cahce_bk));
    rt_memcpy(rx_fifo_buf_cache_bk, rx_fifo_end_ptr, sizeof(rx_fifo_buf_cache_bk));
    /* invalidate d-cache */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, rx_fifo->buffer, serial->config.bufsz);

    rt_memcpy(rx_fifo, &rx_fifo_cahce_bk, sizeof(rx_fifo_cahce_bk));
    rt_memcpy(rx_fifo_end_ptr, rx_fifo_buf_cache_bk, sizeof(rx_fifo_buf_cache_bk));
#endif

    /* IDLE interrupt: can happen at any position */
    if (counter <= uart->last_recv_index)
        recv_len = uart->last_recv_index - counter;
    else
        recv_len = serial->config.bufsz + uart->last_recv_index - counter;

