GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    if (recv_len)
    {
        uart->last_recv_index = counter;
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
    }

    rt_hw_interrupt_enable(level);
}

/**
 * DMA receive done process (HTF/FTF interrupt handler for CIRCULAR mode).
 * HTF fires at 50% of buffer, FTF fires at 100% (wrap point).
 *
 * @param serial serial device
 */
static void dma_rx_done_isr(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    rt_base_t level;
    rt_size_t recv_len, counter;
    rt_bool_t is_htf, is_ftf;

    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;

    /* Check which interrupt fired */
    is_htf = dma_flag_get(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_HTF);
    is_ftf = dma_flag_get(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_FTF);

    /* Clear DMA flags */
    if (is_htf) {
        dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_HTF);
    }
    if (is_ftf) {
        dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_FTF);
    }

    level = rt_hw_interrupt_disable();

    recv_len = 0;
    counter = dma_transfer_number_get(uart->dma_rx->periph, uart->dma_rx->channel);

#ifdef RT_USING_CACHE
    uint32_t *rx_fifo_end_ptr = NULL;
    rx_fifo_end_ptr = (uint32_t *)((uint32_t)rx_fifo->buffer+serial->config.bufsz);
    rt_memcpy(&rx_fifo_cahce_bk, rx_fifo, sizeof(rx_fifo_cahce_bk));
    rt_memcpy(rx_fifo_buf_cache_bk, rx_fifo_end_ptr, sizeof(rx_fifo_buf_cache_bk));
    /* invalidate d-cache */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, rx_fifo->buffer, serial->config.bufsz);

    rt_memcpy(rx_fifo, &rx_fifo_cahce_bk, sizeof(rx_fifo_cahce_bk));
    rt_memcpy(rx_fifo_end_ptr, rx_fifo_buf_cache_bk, sizeof(rx_fifo_buf_cache_bk));
#endif

    if (is_htf) {
        /* Half Transfer: counter < last_recv_index */
        if (counter < uart->last_recv_index)
            recv_len = uart->last_recv_index - counter;
    }
    if (is_ftf) {
        /* Full Transfer Complete: buffer wrapped */
        if (counter >= uart->last_recv_index)
            recv_len = serial->config.bufsz + uart->last_recv_index - counter;
    }

    if (recv_len)
    {
        uart->last_recv_index = counter;
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
    }

    rt_hw_interrupt_enable(level);
}

#endif /* RT_SERIAL_USING_DMA */


/**
 * Uart common interrupt process. This need add to uart ISR.
 *
 * @param serial serial device
 */
static void GD32_UART_IRQHandler(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    RT_ASSERT(uart != RT_NULL);

#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        /* USART5 in mode Receiver */
        if ((usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_RBNE) != RESET))
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
            /* Clear RXNE interrupt flag */
            usart5_flag_clear(USART5, USART5_FLAG_RBNE);
        }
#ifdef RT_SERIAL_USING_DMA
        if(usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_IDLE) != RESET)
        {
            dma_uart_rx_idle_isr(serial);
        }
#endif
        if (usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_TC) != RESET)
        {
            /* clear interrupt */
            usart5_flag_clear(USART5, USART5_FLAG_TC);
            usart5_interrupt_disable(USART5, USART5_INT_TC);
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
        if (usart5_flag_get(USART5, USART5_FLAG_ORERR) == SET)
        {
            usart5_flag_clear(USART5, USART5_FLAG_ORERR);
        }
    }
    else
#endif
    {
        /* UART in mode Receiver -------------------------------------------------*/
	    if ((usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_RBNE) != RESET) &&
	        (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET))
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
            /* Clear RXNE interrupt flag */
            usart_flag_clear(uart->uart_periph, USART_FLAG_RBNE);
        }
#ifdef RT_SERIAL_USING_DMA
        if(usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_IDLE) != RESET)
        {
            dma_uart_rx_idle_isr(serial);
        }
#endif
        if (usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_TC) != RESET)
        {
            /* clear interrupt */
            usart_flag_clear(uart->uart_periph, USART_FLAG_TC);
            usart_interrupt_disable(uart->uart_periph, USART_INT_TC);
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
        if (usart_flag_get(uart->uart_periph, USART_FLAG_ORERR) == SET)
        {
            usart_flag_clear(uart->uart_periph, USART_FLAG_ORERR);
        }
    }
}
static const struct rt_uart_ops gd32_uart_ops =
{
    .configure = gd32_uart_configure,
    .control = gd32_uart_control,
    .putc = gd32_uart_putc,
    .getc = gd32_uart_getc,
#ifndef RT_SERIAL_USING_TX_DMA
    NULL,
#else
    .dma_transmit = gd32_dma_transmit,
#endif
};

/**
  * @brief  uart init
  * @param  None
  * @retval None
  */
int rt_hw_usart_init(void)
{
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
    int i;

    int result;
    rt_uint32_t flag = 0;

    for (i = 0; i < sizeof(uart_obj) / sizeof(uart_obj[0]); i++)
    {
        uart_obj[i].serial->ops    = &gd32_uart_ops;
        uart_obj[i].serial->config = config;

        flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;
#if defined(RT_SERIAL_USING_DMA)
        flag |= RT_DEVICE_FLAG_DMA_RX;
#if defined(RT_SERIAL_USING_TX_DMA)
        flag |= RT_DEVICE_FLAG_DMA_TX;
#endif
#endif
        /* register UART1 device */
        result = rt_hw_serial_register(uart_obj[i].serial,
                              uart_obj[i].device_name,
                              flag,
                              (void *)&uart_obj[i]);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#endif
